tap "homebrew/bundle", "https://mirror.nju.edu.cn/git/homebrew-bundle.git/"
tap "homebrew/command-not-found", "https://mirrors.bfsu.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services", "https://mirrors.bfsu.edu.cn/git/homebrew/homebrew-services.git"
# Zstandard is a real-time compression algorithm
brew "zstd"
# BLAKE2 b2sum reference binary
brew "b2sum"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# File comparison utilities
brew "diffutils"
# More intuitive version of du in rust
brew "dust"
# GNU Emacs text editor
brew "emacs"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Powerful, lightweight programming language
brew "lua"
# Platform built on V8 to build network applications
brew "node@22"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Fast, disk space efficient package manager
brew "pnpm"
# Show ps output as a tree
brew "pstree"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Steel Bank Common Lisp system
brew "sbcl"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to impose load on and stress test a computer system
brew "stress"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Utility to track your highest uptimes
brew "uptimed", restart_service: :changed
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
